// lesson1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <iostream>
#include <Windows.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    float a, b, c, x, s;
    printf("\n Введите гипотенузу и угол треугольника ");
    scanf_s("%f, %f", &c, &x);
    a = c * sin(x);
    b = c * cos(x);
    s = a * b;
    printf("\n Результаты: a=%7.2f b=%7.2f s=%7.2f ", a, b, s);
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
